---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalResourceBrowserData
source: html/0edaae9f-f5f4-5984-8c39-3065c0b92cbc.htm
---
# ExternalResourceBrowserData Members

Constructs a new ExternalResourceBrowserData using the given document(optional), server id, folder path and match options.